src/Catalogs/ЭД_Строки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Строки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭД_Модель</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоставАналитик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВСвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЭД_ТипыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитАналитикиДляСортировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Модель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Модель</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаМакетаИмпортаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_МакетыИмпорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЭД_ТипыАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриоритетДляНастроек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Строки/Ext/ObjectModule.bsl
Процедура ПроверитьУникальностьАналитик(Отказ)
	
	тзАналитики = Аналитики.Выгрузить();
	тзАналитики.Колонки.Добавить("Количество");
	тзАналитики.ЗаполнитьЗначения(1, "Количество");
	тзАналитики.Свернуть("Аналитика", "Количество");
	
	Для Каждого Строка Из тзАналитики Цикл
		
		Если Строка.Количество > 1 Тогда 
			Отказ = Истина;
			Сообщить("Аналитика """ + Строка.Аналитика + """ указана несколько раз. Аналитики должны быть уникальными в пределах строки.", СтатусСообщения.Важное);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверитьНаличиеАналитикиВМодели(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭД_МодельРеквизитыДокумента.Реквизит.ПредставлениеРеквизита КАК ПредставлениеРеквизита
		|ИЗ
		|	Справочник.ЭД_Модель.РеквизитыДокумента КАК ЭД_МодельРеквизитыДокумента
		|ГДЕ
		|	ЭД_МодельРеквизитыДокумента.Реквизит В(&Аналитики)
		|	И ЭД_МодельРеквизитыДокумента.Ссылка = &Модель";
	
	Запрос.УстановитьПараметр("Аналитики",	Аналитики.ВыгрузитьКолонку("Аналитика"));
	Запрос.УстановитьПараметр("Модель", 	Ссылка.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Отказ = Выборка.Количество() > 0;
	
	Пока Выборка.Следующий() Цикл
		Сообщить("В реквизитах модели уже используется аналитика """ + Выборка.ПредставлениеРеквизита + """."); 
	КонецЦикла; 	
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;    	
	
	ПроверитьУникальностьАналитик(Отказ);
	ПроверитьНаличиеАналитикиВМодели(Отказ);
	
	Если Не Отказ Тогда
	
		СоставАналитик = "";
		Для Каждого ТекСтрока Из ЭтотОбъект.Аналитики Цикл
			
			СоставАналитик = СоставАналитик + ТекСтрока.Аналитика.Наименование + ", ";
			
		КонецЦикла;
		СоставАналитик = Лев(СоставАналитик, СтрДлина(СоставАналитик)-2);
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = "С";
	
КонецПроцедуры
